In [1]:
import pandas as pd

In [2]:
df_read = pd.read_csv("datasets/fact_bookings.csv")
df_date = pd.read_csv("datasets/dim_date.csv")
df_hotels = pd.read_csv("datasets/dim_hotels.csv")
df_rooms = pd.read_csv("datasets/dim_rooms.csv")
df_agg = pd.read_csv("datasets/fact_aggregated_bookings.csv")
df_bookings = pd.read_csv("datasets/fact_bookings.csv")

In [3]:
df_agg.head()

   property_id check_in_date room_category  successful_bookings  capacity
0        16559      1-May-22           RT1                   25      30.0
1        19562      1-May-22           RT1                   28      30.0
2        19563      1-May-22           RT1                   23      30.0
3        17558      1-May-22           RT1                   30      19.0
4        16558      1-May-22           RT1                   18      19.0

In [4]:
df_agg["occ_pct"] = df_agg["successful_bookings"]/df_agg["capacity"]

In [5]:
df_agg.head()

,property_id,check_in_date,room_category,successful_bookings,capacity,occ_pct
0,16559,1-May-22,RT1,25,30.0,0.833333
1,19562,1-May-22,RT1,28,30.0,0.933333
2,19563,1-May-22,RT1,23,30.0,0.766667
3,17558,1-May-22,RT1,30,19.0,1.578947
4,16558,1-May-22,RT1,18,19.0,0.947368

In [11]:
df_agg.head()

,property_id,check_in_date,room_category,successful_bookings,capacity,occ_pct
0,16559,1-May-22,RT1,25,30.0,83330000.0
1,19562,1-May-22,RT1,28,30.0,93330000.0
2,19563,1-May-22,RT1,23,30.0,76670000.0
3,17558,1-May-22,RT1,30,19.0,157890000.0
4,16558,1-May-22,RT1,18,19.0,94740000.0

In [ ]:
df_agg["occ_pct"] = df_agg["successful_bookings"]/df_agg["capacity"]

In [12]:
df_agg.head()

,property_id,check_in_date,room_category,successful_bookings,capacity,occ_pct
0,16559,1-May-22,RT1,25,30.0,83330000.0
1,19562,1-May-22,RT1,28,30.0,93330000.0
2,19563,1-May-22,RT1,23,30.0,76670000.0
3,17558,1-May-22,RT1,30,19.0,157890000.0
4,16558,1-May-22,RT1,18,19.0,94740000.0